Revit 2024 API
BuiltInFailures.StairRampFailures.StairsComponentJoinFailure Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsComponentJoinFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsComponentJoinFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace